In [1]:
import pandas as pd

# Group By

**It is used to group same data**
***

In [2]:
var=pd.DataFrame({
                  "Name":["A","B","C","D","A","B","A","B","A","C","C","D"],
                  "S_1":[12,14,13,16,14,15,15,13,16,12,15,13],
                  "S_2":[22,18,23,22,23,20,22,25,18,23,20,25]
                 })

In [3]:
var

   Name  S_1  S_2
0     A   12   22
1     B   14   18
2     C   13   23
3     D   16   22
4     A   14   23
5     B   15   20
6     A   15   22
7     B   13   25
8     A   16   18
9     C   12   23
10    C   15   20
11    D   13   25

***
# Getting all values grouped Data

In [4]:
varNw=var.groupby("Name")#groupby("col_name acc to which we want to group data.")
varNw

***

**==> First varibale determines Names Col_Data(A,B,C & D).**

**==> Second variable determines S_1 & S_2 Data.**

In [5]:
for x,y in varNw:
    print(x)
    print(y)
    print()

A
  Name  S_1  S_2
0    A   12   22
4    A   14   23
6    A   15   22
8    A   16   18

B
  Name  S_1  S_2
1    B   14   18
5    B   15   20
7    B   13   25

C
   Name  S_1  S_2
2     C   13   23
9     C   12   23
10    C   15   20

D
   Name  S_1  S_2
3     D   16   22
11    D   13   25

In [6]:
varNw=var.groupby("S_1")#groupby("col_name acc to which we want to group data.")
varNw

In [7]:
for i,j in varNw:
    print(i)
    print(j)
    print()

12
  Name  S_1  S_2
0    A   12   22
9    C   12   23

13
   Name  S_1  S_2
2     C   13   23
7     B   13   25
11    D   13   25

14
  Name  S_1  S_2
1    B   14   18
4    A   14   23

15
   Name  S_1  S_2
5     B   15   20
6     A   15   22
10    C   15   20

16
  Name  S_1  S_2
3    D   16   22
8    A   16   18

***
# Getting single value grouped value

**get_group("data") is used for this purpose.**

**It works with grouped data.**

In [8]:
varNw.get_group(13) # returns Df of 13's grouped data

   Name  S_1  S_2
2     C   13   23
7     B   13   25
11    D   13   25

***
# Getting min/max/min value

In [9]:
varNw.min()

    Name  S_2
S_1
12     A   22
13     B   23
14     A   18
15     A   20
16     A   18

In [10]:
varNw.min()

    Name  S_2
S_1
12     A   22
13     B   23
14     A   18
15     A   20
16     A   18

In [19]:
# varNw.mean() gives mean